toitlang/toit/src/resources/uart_esp32.cc
// Copyright (C) 2018 Toitware ApS.
//
// This library is free software; you can redistribute it and/or
// modify it under the terms of the GNU Lesser General Public
// License as published by the Free Software Foundation; version
// 2.1 only.
//
// This library is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
// Lesser General Public License for more details.
//
// The license can be found in the file `LICENSE` in the top level
// directory of this repository.

#include "../top.h"

#ifdef TOIT_ESP32

#include <unistd.h>

#include "driver/gpio.h"
#include "driver/uart.h"
#include "soc/uart_periph.h"
#include "esp_log.h"
#include "esp_rom_gpio.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"

#include "../objects_inline.h"
#include "../resource_pool.h"
#include "../event_sources/system_esp32.h"
#include "../event_sources/ev_queue_esp32.h"
#include "../utils.h"

#include "gpio_esp32.h"
#include "uart_console_esp32.h"

#ifndef FORCE_INLINE
#error "FORCE_INLINE not defined"
#endif
#define UART_ISR_INLINE FORCE_INLINE

// Valid UART port numbers.
#define UART_NUM_0             (static_cast<uart_port_t>(0)) /*!< UART port 0 */
#define UART_NUM_1             (static_cast<uart_port_t>(1)) /*!< UART port 1 */
#if SOC_UART_HP_NUM > 2
#define UART_NUM_2             (static_cast<uart_port_t>(2)) /*!< UART port 2 */
#endif
#if SOC_UART_HP_NUM > 3
#error "SOC_UART_HP_NUM > 3"
#endif
#define UART_NUM_MAX           (SOC_UART_HP_NUM) /*!< UART port max */

namespace toit {

static_assert(SOC_UART_HP_NUM * UART_QUEUE_SIZE <= UART_EVENT_QUEUE_SIZE,
              "Increase UART_EVENT_QUEUE_SIZE");

class UartResource;

const uart_port_t kInvalidUartPort = static_cast<uart_port_t>(-1);

const int kReadState = 1 << 0;
const int kErrorState = 1 << 1;
const int kWriteState = 1 << 2;
const int kBreakState = 1 << 3;

const int kHighSpeedBaudRate = 460800;
const uint8 kHighSpeedRxFullThreshold = 35;
const uint8 kLowSpeedRxFullThreshold = 105;

static ResourcePool<uart_port_t, kInvalidUartPort> uart_ports(
#ifndef CONFIG_ESP_CONSOLE_UART
    UART_NUM_0,
    UART_NUM_1
#elif (CONFIG_ESP_CONSOLE_UART_NUM != 0)
    UART_NUM_0
#else
    UART_NUM_1
#endif
#if SOC_UART_HP_NUM > 2
  , UART_NUM_2
#endif
);

#ifdef CONFIG_ESP_CONSOLE_UART
// The console UART is excluded from `uart_ports` above. It can only be
// opened through the dedicated console primitive.
static ResourcePool<uart_port_t, kInvalidUartPort> console_uart_port(
    static_cast<uart_port_t>(CONFIG_ESP_CONSOLE_UART_NUM)
);
#endif

class UartResourceGroup;

class UartResource : public EventQueueResource {
public:
  TAG(UartResource);

  UartResource(ResourceGroup* group, uart_port_t port, int tx_buffer_size, QueueHandle_t queue)
      : EventQueueResource(group, queue)
      , port_(port)
      , tx_buffer_size_(tx_buffer_size) {}

  UartResource(ResourceGroup* group, uart_port_t port, int tx_buffer_size, QueueHandle_t queue, bool is_console)
      : EventQueueResource(group, queue)
      , port_(port)
      , tx_buffer_size_(tx_buffer_size)
      , is_console_(is_console) {}

  ~UartResource() override;

  uart_port_t port() const { return port_; }

  int errors() const { return errors_; }

  int tx_buffer_size() const { return tx_buffer_size_; }

  bool is_console() const { return is_console_; }

  // GPIO pins reserved by this port (tx/rx/rts/cts).
  GpioPins& owned_pins() { return owned_pins_; }

 bool receive_event(word* data) override;

#ifdef CONFIG_TOIT_REPORT_UART_DATA_LOSS
  bool has_dropped_data() const { return dropped_data_; }
  bool has_reported_dropped_data() const { return has_reported_dropped_data_; }
  void set_has_reported_dropped_data() { has_reported_dropped_data_ = true; }
#endif

 private:
  const uart_port_t port_;
  const int tx_buffer_size_;
  const bool is_console_ = false;
  int64 errors_ = 0;
  GpioPins owned_pins_;

  #ifdef CONFIG_TOIT_REPORT_UART_DATA_LOSS
  bool dropped_data_ = false;
  bool has_reported_dropped_data_ = false;

  void signal_dropped_data() { dropped_data_ = true; }
#else
  void signal_dropped_data() {}
#endif

  // TODO(florian): do we need a lock.
  // Errors is a 64-bit number. Could the 'errors' function read only part of it.?
  // I don't think we need to worry about incrementing itself, as that happens only
  // in the 'on_event' method, which should run "single-threaded".
  void increment_errors() { errors_++; }

  friend class UartResourceGroup;
};

class UartResourceGroup : public ResourceGroup {
 public:
  TAG(UartResourceGroup);
  UartResourceGroup(Process* process, EventSource* event_source)
      : ResourceGroup(process, event_source){}

  void on_unregister_resource(Resource* r) override {
    auto uart_res = reinterpret_cast<UartResource*>(r);
#ifdef CONFIG_ESP_CONSOLE_UART
    if (uart_res->is_console()) {
      console_uart_port.put(uart_res->port());
      return;
    }
#endif
    uart_ports.put(uart_res->port());
  }

  uint32 on_event(Resource* r, word data, uint32 state) override;
};

UartResource::~UartResource() {
#ifdef CONFIG_ESP_CONSOLE_UART
  if (is_console_) {
    console_uart_release();
  } else
#endif
  {
    esp_err_t err = uart_driver_delete(port_);
    if (err != ESP_OK) {
      esp_rom_printf("[uart] error: failed to delete UART driver\n");
      ESP_ERROR_CHECK(err);
    }
  }
  // Release any GPIO pins this port reserved.
  owned_pins_.release();
}

bool UartResource::receive_event(word* data) {
  uart_event_t event;
  bool result = xQueueReceive(queue(), &event, 0);
  *data = event.type;
  return result;
}

uint32 UartResourceGroup::on_event(Resource* r, word data, uint32 state) {
  switch (data) {
    case UART_DATA:
      state |= kReadState;
      break;

    case UART_TX_DONE:
      state |= kWriteState;
      break;

    case UART_BREAK:
      state |= kBreakState;
      break;

    case UART_BUFFER_FULL:
    case UART_FIFO_OVF:
      reinterpret_cast<UartResource*>(r)->signal_dropped_data();
      [[fallthrough]];

    case UART_PARITY_ERR:
      state |= kErrorState;
      reinterpret_cast<UartResource*>(r)->increment_errors();
      break;

    case UART_DATA_BREAK:
      // UART TX data and break event.
      // Only used by the driver to signal the interrupt that it has data that
      // should be terminated with a break.
      esp_rom_printf("[uart] error: received unexpected UART_DATA_BREAK event\n");
      break;

    case UART_PATTERN_DET:
      // We haven't given access to pattern detection.
      esp_rom_printf("[uart] error: received unexpected UART_PATTERN_DET event\n");
      break;
#if SOC_UART_SUPPORT_WAKEUP_INT
    case UART_WAKEUP:
      esp_rom_printf("[uart] error: received unexpected UART_WAKEUP event\n");
      break;
#endif

