toitlang/toit/src/resources/uart_esp32.cc
    case UART_TX_ENTRY_RETIRED:
      state |= kWriteState;
      break;

    case UART_EVENT_MAX:
      UNREACHABLE();
  }

  return state;
}

MODULE_IMPLEMENTATION(uart, MODULE_UART)

#ifdef CONFIG_ESP_CONSOLE_UART
static int console_uart_users = 0;
static QueueHandle_t console_uart_queue = null;

esp_err_t console_uart_acquire(int rx_buffer_size, int tx_buffer_size, QueueHandle_t* queue) {
  Locker locker(OS::global_mutex());
  if (console_uart_users > 0) {
    // Buffer sizes only affect the first driver installation. Stdin requests
    // the largest sizes exposed by Port.console. If Port.console installs its
    // smaller default receive buffer first, stdin still works and makes no
    // public buffer-size guarantee.
    console_uart_users++;
    *queue = console_uart_queue;
    return ESP_OK;
  }

  struct {
    uart_port_t port;
    int rx_buffer_size;
    int tx_buffer_size;
    esp_err_t result;
  } args = {
    .port = static_cast<uart_port_t>(CONFIG_ESP_CONSOLE_UART_NUM),
    .rx_buffer_size = rx_buffer_size,
    .tx_buffer_size = tx_buffer_size,
    .result = ESP_FAIL,
  };
  SystemEventSource::instance()->run([&args]() -> void {
    args.result = uart_driver_install(args.port,
                                      args.rx_buffer_size,
                                      args.tx_buffer_size,
                                      UART_QUEUE_SIZE,
                                      &console_uart_queue,
                                      ESP_INTR_FLAG_SHARED | ESP_INTR_FLAG_LEVEL2 | ESP_INTR_FLAG_LEVEL1);
  });
  if (args.result != ESP_OK) return args.result;

  esp_err_t err = uart_flush_input(args.port);
  if (err != ESP_OK) {
    SystemEventSource::instance()->run([&args]() -> void {
      uart_driver_delete(args.port);
    });
    console_uart_queue = null;
    return err;
  }

  console_uart_users = 1;
  *queue = console_uart_queue;
  return ESP_OK;
}

void console_uart_release() {
  Locker locker(OS::global_mutex());
  ASSERT(console_uart_users > 0);
  if (--console_uart_users != 0) return;

  uart_port_t port = static_cast<uart_port_t>(CONFIG_ESP_CONSOLE_UART_NUM);
  esp_err_t err = ESP_FAIL;
  SystemEventSource::instance()->run([&]() -> void {
    err = uart_driver_delete(port);
  });
  console_uart_queue = null;
  if (err != ESP_OK) {
    esp_rom_printf("[uart] error: failed to delete console UART driver\n");
    ESP_ERROR_CHECK(err);
  }
}
#endif

PRIMITIVE(init) {
  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  UartResourceGroup* uart_group = _new UartResourceGroup(process, EventQueueEventSource::instance());
  if (!uart_group) FAIL(MALLOC_FAILED);

  proxy->set_external_address(uart_group);
  return proxy;
}

static uart_port_t determine_preferred_port(int tx, int rx, int rts, int cts) {
  for (int uart = UART_NUM_0; uart < SOC_UART_HP_NUM; uart++) {
    if ((tx == -1 || tx == uart_periph_signal[uart].pins[SOC_UART_TX_PIN_IDX].default_gpio) &&
        (rx == -1 || rx == uart_periph_signal[uart].pins[SOC_UART_RX_PIN_IDX].default_gpio) &&
        (rts == -1 || rts == uart_periph_signal[uart].pins[SOC_UART_RTS_PIN_IDX].default_gpio) &&
        (cts == -1 || cts == uart_periph_signal[uart].pins[SOC_UART_CTS_PIN_IDX].default_gpio)) {
      return static_cast<uart_port_t>(uart);
    }
  }
  return kInvalidUartPort;
}

static inline uart_parity_t int_to_uart_parity(int parity) {
  switch (parity) {
    case 1: return UART_PARITY_DISABLE;
    case 2: return UART_PARITY_EVEN;
    case 3: return UART_PARITY_ODD;
    default: UNREACHABLE(); return UART_PARITY_DISABLE;
  }
}
static uart_word_length_t data_bits_to_uart_word_length(int data_bits) {
  switch (data_bits) {
    case 5: return UART_DATA_5_BITS;
    case 6: return UART_DATA_6_BITS;
    case 7: return UART_DATA_7_BITS;
    case 8: return UART_DATA_8_BITS;
    default: UNREACHABLE();
  }
}

static uart_stop_bits_t int_to_uart_stop_bits(int stop_bits) {
  switch (stop_bits) {
    case 1: return UART_STOP_BITS_1;
    case 2: return UART_STOP_BITS_1_5;
    case 3: return UART_STOP_BITS_2;
    default: UNREACHABLE();
  }
}

static uart_mode_t int_to_uart_mode(int mode) {
  switch (mode) {
    case 0: return UART_MODE_UART;
    case 1: return UART_MODE_RS485_HALF_DUPLEX;
    case 2: return UART_MODE_IRDA;
    default: UNREACHABLE();
  }
}

namespace {  // Anonymous.
struct DriverArgs {
  uart_port_t port;
  uint16_t rx_buffer_size;
  uint16_t tx_buffer_size;
  int interrupt_flags;
  QueueHandle_t* queue;
  size_t queue_size;
};
}  // Anonymous namespace.

PRIMITIVE(create) {
  ARGS(UartResourceGroup, group, int, tx, int, rx, int, rts, int, cts,
       int, baud_rate, int, data_bits, int, stop_bits, int, parity,
       int, options, int, mode)

  // Keep the encoded pin values for reservation, then switch tx/rx/rts/cts to
  // the decoded GPIO numbers so the validation and the rest of the primitive can
  // use them directly. Pins to reserve (>= 0) are handled below, after validation.
  int tx_encoded = tx, rx_encoded = rx, rts_encoded = rts, cts_encoded = cts;
  bool decode_owned;
  tx = gpio_decode_pin(tx, &decode_owned);
  rx = gpio_decode_pin(rx, &decode_owned);
  rts = gpio_decode_pin(rts, &decode_owned);
  cts = gpio_decode_pin(cts, &decode_owned);

  if (data_bits < 5 || data_bits > 8) FAIL(INVALID_ARGUMENT);
  if (stop_bits < 1 || stop_bits > 3) FAIL(INVALID_ARGUMENT);
  if (parity < 1 || parity > 3) FAIL(INVALID_ARGUMENT);
  if (options < 0 || options > 31) FAIL(INVALID_ARGUMENT);
  if (mode < UART_MODE_UART || mode > UART_MODE_IRDA) FAIL(INVALID_ARGUMENT);
  if (mode == UART_MODE_RS485_HALF_DUPLEX && (rts == -1 || cts != -1)) FAIL(INVALID_ARGUMENT);
  if (baud_rate < 0 || baud_rate > SOC_UART_BITRATE_MAX) FAIL(INVALID_ARGUMENT);
  if (tx >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(tx)) FAIL(INVALID_ARGUMENT);
  if (rx >= 0 && !GPIO_IS_VALID_GPIO(rx)) FAIL(INVALID_ARGUMENT);
  if (tx == rx && tx != -1) {
    // It's theoretically possible to share pins for TX and RX, but that could
    // damage the hardware, if the pins aren't configured for open-drain and pull-up.
    // For now we just disallow it.
    UNIMPLEMENTED();
  }
  if (rts >= 0 && !GPIO_IS_VALID_OUTPUT_GPIO(rts)) FAIL(INVALID_ARGUMENT);
  if (cts >= 0 && !GPIO_IS_VALID_GPIO(cts)) FAIL(INVALID_ARGUMENT);

