toitlang/toit/src/resources/uart_esp32.cc
  // Reserve the pins from the shared pool. The reserver releases them
  // again if we leave the primitive without calling `keep()`.
  GpioPinReserver reserver;
  bool reserve_ok = true;
  reserver.decode_and_take(tx_encoded, &reserve_ok);
  reserver.decode_and_take(rx_encoded, &reserve_ok);
  reserver.decode_and_take(rts_encoded, &reserve_ok);
  reserver.decode_and_take(cts_encoded, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  uint8 full_interrupt_threshold;
  uint16 rx_buffer_size, tx_buffer_size;
  int interrupt_flags = ESP_INTR_FLAG_SHARED;
#ifdef CONFIG_IDF_TARGET_ESP32C3
  // Level 3 interrupts hang the C3 for some reason.
  static const int HI  = ESP_INTR_FLAG_LEVEL2;
  static const int MED = ESP_INTR_FLAG_LEVEL2;
  static const int LO  = ESP_INTR_FLAG_LEVEL2 | ESP_INTR_FLAG_LEVEL1;
#else
  static const int HI  = ESP_INTR_FLAG_LEVEL3;
  static const int MED = ESP_INTR_FLAG_LEVEL3 | ESP_INTR_FLAG_LEVEL2;
  static const int LO  = ESP_INTR_FLAG_LEVEL3 | ESP_INTR_FLAG_LEVEL2 | ESP_INTR_FLAG_LEVEL1;
#endif
  if ((options & 8) != 0) {
    // High speed setting.
    interrupt_flags |= HI;
    full_interrupt_threshold = kHighSpeedRxFullThreshold;
    tx_buffer_size = 2048;
    rx_buffer_size = 2048;
  } else if ((options & 4) != 0) {
    // Medium speed setting.
    interrupt_flags |= MED;
    full_interrupt_threshold = 92;
    tx_buffer_size = 512;
    rx_buffer_size = 1536;
  } else {
    // Low speed setting.
    interrupt_flags |= LO;
    full_interrupt_threshold = kLowSpeedRxFullThreshold;
    tx_buffer_size = 256;
    rx_buffer_size = 768;
  }
  if ((options & 16) != 0) {
    tx_buffer_size *= 2;
    rx_buffer_size *= 2;
  }

  // Whether the resource object has been created and is thus responsible
  // for returning resources.
  bool handed_to_resource = false;

  uart_port_t port = determine_preferred_port(tx, rx, rts, cts);
  port = uart_ports.preferred(port);
  if (port == kInvalidUartPort) FAIL(ALREADY_IN_USE);
  Defer return_port { [&] { if (!handed_to_resource) uart_ports.put(port); } };

  if (tx == -1) {
    tx_buffer_size = 0;
  }
  if (rx == -1) {
    // The driver still wants the rx-buffer size to be > the HW FIFO size.
    rx_buffer_size = UART_HW_FIFO_LEN(port) + 1;
  }

  esp_err_t err;
  QueueHandle_t queue;
  DriverArgs args = {
    .port = port,
    .rx_buffer_size = rx_buffer_size,
    .tx_buffer_size = tx_buffer_size,
    .interrupt_flags = interrupt_flags,
    .queue = &queue,
    .queue_size = UART_QUEUE_SIZE,
  };
  // Install the ISR on the SystemEventSource's main thread that runs on core 0,
  // to allocate the interrupts on core 0.
  SystemEventSource::instance()->run([&]() -> void {
    err = uart_driver_install(args.port,
                              args.rx_buffer_size,
                              args.tx_buffer_size,
                              args.queue_size,
                              args.queue,
                              args.interrupt_flags);
  });
  if (err != ESP_OK) return Primitive::os_error(err, process);
  Defer uninstall_driver { [&] { if (!handed_to_resource) uart_driver_delete(port); } };

  err = uart_set_rx_full_threshold(port, full_interrupt_threshold);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  err = uart_set_mode(port, int_to_uart_mode(mode));
  if (err != ESP_OK) return Primitive::os_error(err, process);

  uart_hw_flowcontrol_t hw_flowcontrol = UART_HW_FLOWCTRL_DISABLE;
  if (mode != UART_MODE_RS485_HALF_DUPLEX && (rts != -1 || cts != -1)) {
    if (rts != -1 && cts != -1) {
      hw_flowcontrol = UART_HW_FLOWCTRL_CTS_RTS;
    } else if (rts != -1) {
      hw_flowcontrol = UART_HW_FLOWCTRL_RTS;
    } else {
      ASSERT(cts != -1);
      hw_flowcontrol = UART_HW_FLOWCTRL_CTS;
    }
  }
  uart_config_t uart_config = {
    .baud_rate = baud_rate,
    .data_bits = data_bits_to_uart_word_length(data_bits),
    .parity = int_to_uart_parity(parity),
    .stop_bits = int_to_uart_stop_bits(stop_bits),
    .flow_ctrl = hw_flowcontrol,
    // Unused if flow_ctrl is disabled, but 122 seems to be a common default, otherwise.
    .rx_flow_ctrl_thresh = 122,
    .source_clk = UART_SCLK_DEFAULT,
    .flags = {
      .allow_pd = 0,
      .backup_before_sleep = 0,
    },
  };

  err = uart_param_config(port, &uart_config);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  // Make sure the RX line idles high *before* it is connected to the UART. The
  // driver has already been installed (the receiver is running), and `uart_set_pin`
  // no longer enables an RX pull-up, so connecting a floating-low RX pin makes the
  // receiver see a start bit; once the pull-up below raises the line the receiver
  // decodes a spurious 0xFF byte (which arrives after the flush below). Enabling the
  // pull-up first keeps the hand-off glitch-free.
  if (rx != -1) {
    gpio_set_pull_mode(static_cast<gpio_num_t>(rx), GPIO_PULLUP_ONLY);
  }

  err = uart_set_pin(port, tx, rx, rts, cts);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  uint32_t inverse_mask = 0;
  if ((options & 1) != 0) inverse_mask |= UART_SIGNAL_TXD_INV;
  if ((options & 2) != 0) inverse_mask |= UART_SIGNAL_RXD_INV;
  err = uart_set_line_inverse(port, inverse_mask);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  // Newer ESP-IDF's `uart_set_pin` no longer enables an internal pull-up on the
  // RX pin (older versions did `GPIO_PULLUP_ONLY`). Without it the RX line
  // floats while the peer isn't driving and dips below the logic threshold,
  // which the receiver reads as a spurious 0x00 start bit, corrupting the first
  // byte of every transfer. Keep the idle line high by restoring the pull-up.
  if (rx != -1) {
    gpio_set_pull_mode(static_cast<gpio_num_t>(rx), GPIO_PULLUP_ONLY);
  }

  // Clear the input buffer. Just in case older data was buffered.
  err = uart_flush_input(port);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  auto resource = _new UartResource(group, port, tx_buffer_size, queue);
  if (!resource) FAIL(MALLOC_FAILED);
  handed_to_resource = true;

  // The reservation now belongs to the resource and is released on close.
  resource->owned_pins().adopt(reserver);
  reserver.keep();

  group->register_resource(resource);
  proxy->set_external_address(resource);
  return proxy;
}

PRIMITIVE(create_path) {
  FAIL(UNIMPLEMENTED);
}

