toitlang/toit/src/resources/uart_esp32.cc
PRIMITIVE(create_console) {
#ifndef CONFIG_ESP_CONSOLE_UART
  FAIL(UNSUPPORTED);
#else
  ARGS(UartResourceGroup, group, int, rx_buffer_size, int, tx_buffer_size)

  uart_port_t port = static_cast<uart_port_t>(CONFIG_ESP_CONSOLE_UART_NUM);

  // The driver requires the RX buffer to be bigger than the hardware FIFO.
  if (rx_buffer_size <= UART_HW_FIFO_LEN(port) || rx_buffer_size > 32 * 1024) FAIL(INVALID_ARGUMENT);
  if (tx_buffer_size < 0 || tx_buffer_size > 32 * 1024) FAIL(INVALID_ARGUMENT);

  if (!console_uart_port.take(port)) FAIL(ALREADY_IN_USE);
  // Whether the resource object has been created and is thus responsible
  // for returning resources.
  bool handed_to_resource = false;
  Defer return_port { [&] { if (!handed_to_resource) console_uart_port.put(port); } };

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  // The console UART keeps the configuration (baud rate, pins, ...) it was
  // given during boot; only the driver is installed, which makes RX
  // interrupt driven. System output (logging, `print`) keeps going through
  // whichever UART VFS mode is active.

  esp_err_t err;
  QueueHandle_t queue;
  err = console_uart_acquire(rx_buffer_size, tx_buffer_size, &queue);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  Defer uninstall_driver { [&] { if (!handed_to_resource) console_uart_release(); } };

  // Discard anything that was received before the port was opened.
  err = uart_flush_input(port);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  auto resource = _new UartResource(group, port, tx_buffer_size, queue, true);
  if (!resource) FAIL(MALLOC_FAILED);
  handed_to_resource = true;

  group->register_resource(resource);
  proxy->set_external_address(resource);
  return proxy;
#endif
}

PRIMITIVE(close) {
  ARGS(UartResourceGroup, uart, UartResource, res)
  uart->unregister_resource(res);
  res_proxy->clear_external_address();
  return process->null_object();
}

PRIMITIVE(get_baud_rate) {
  ARGS(UartResource, uart)
  uint32_t result;
  esp_err_t err = uart_get_baudrate(uart->port(), &result);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  return Primitive::integer(result, process);
}

PRIMITIVE(set_baud_rate) {
  ARGS(UartResource, uart, uint32, baud_rate)
#ifdef CONFIG_ESP_CONSOLE_UART
  if (uart->port() == CONFIG_ESP_CONSOLE_UART_NUM) {
    // The console has no speed option. Leave enough room in the hardware FIFO
    // for interrupt latency when flash operations temporarily stall the CPU.
    uint8 threshold = baud_rate >= kHighSpeedBaudRate
        ? kHighSpeedRxFullThreshold
        : kLowSpeedRxFullThreshold;
    esp_err_t err = uart_set_rx_full_threshold(uart->port(), threshold);
    if (err != ESP_OK) return Primitive::os_error(err, process);
  }
#endif
  esp_err_t err = uart_set_baudrate(uart->port(), baud_rate);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  return process->null_object();
}

PRIMITIVE(write) {
  ARGS(UartResource, uart, Blob, data, int, from, int, to, int, break_length)

  if (from < 0 || from > to || to > data.length()) FAIL(OUT_OF_RANGE);
  if (break_length < 0 || break_length >= 256) FAIL(OUT_OF_RANGE);

  size_t to_write = to - from;
  size_t MAX_CHUNK_SIZE = uart->tx_buffer_size() / 4;
  size_t written = 0;

  while (to_write > written) {
    size_t available;
    esp_err_t err = uart_get_tx_buffer_free_size(uart->port(), &available);
    if (err != ESP_OK) return Primitive::os_error(err, process);

    size_t chunk_size = to_write - written;
    // We write at most MAX_CHUNK_SIZE entries. Whenever an entry is retired, we
    // get an event, which means that we can continue filling up the buffers.
    // If we wrote everything in one go, we wouldn't be able to keep the buffers
    // filled.
    if (chunk_size > MAX_CHUNK_SIZE) chunk_size = MAX_CHUNK_SIZE;
    if (chunk_size > available) chunk_size = available;
    if (chunk_size == 0) break;

    const char* src = reinterpret_cast<const char*>(data.address() + from + written);
    bool is_last_chunk = (to_write == written + chunk_size);
    if (break_length == 0 || !is_last_chunk) {
      err = uart_write_bytes(uart->port(), src, chunk_size);
    } else {
      err = uart_write_bytes_with_break(uart->port(), src, chunk_size, break_length);
    }
    if (err < 0) return Primitive::os_error(err, process);
    written += chunk_size;
  }
  return Smi::from(written);
}

PRIMITIVE(wait_tx) {
  ARGS(UartResource, uart)

  esp_err_t err = uart_wait_tx_done(uart->port(), 0);
  if (err == ESP_ERR_TIMEOUT) return BOOL(false);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  return BOOL(true);
}

PRIMITIVE(read) {
  ARGS(UartResource, uart)

#ifdef CONFIG_TOIT_REPORT_UART_DATA_LOSS
  if (uart->has_dropped_data() && !uart->has_reported_dropped_data()) {
    uart->set_has_reported_dropped_data();
    ESP_LOGE("uart", "dropped data; no further warnings will be issued");
  }
#endif

  auto port = uart->port();

  size_t available;
  esp_err_t err = uart_get_buffered_data_len(port, &available);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  if (available == 0) return process->null_object();

  ByteArray* data = process->allocate_byte_array(available);
  if (data == null) FAIL(ALLOCATION_FAILED);

  ByteArray::Bytes rx(data);
  int read = uart_read_bytes(port, rx.address(), static_cast<uint32_t>(available), 0);
  if (read != available) FAIL(INVALID_STATE);
  return data;
}

PRIMITIVE(set_control_flags) {
  FAIL(UNIMPLEMENTED);
}

PRIMITIVE(get_control_flags) {
  FAIL(UNIMPLEMENTED);
}

PRIMITIVE(errors) {
  ARGS(UartResource, uart)
  return Primitive::integer(uart->errors(), process);
}

} // namespace toit

#endif // TOIT_ESP32
